In [10]:
import pandas as pd

In [11]:
house_pricing = pd.read_csv("house-pricing.csv")
house_pricing.head()

      house_id Neighborhood  YearBuilt          Price
0   house-2546        Rural       2011  310456.157638
1  house-11094        Rural       1976  195310.913642
2  house-24107        Urban       1976  325239.351743
3  house-17677        Rural       1952  247969.731066
4   house-6967       Suburb       1991  300178.479654

In [12]:
house_spesification = pd.read_csv("house-spesifications.csv")
house_spesification.head()

   house_id  SquareFeet  Bedrooms  Bathrooms
0  house-01        2126         4          1
1  house-02        2459         3          2
2  house-03        1860         2          1
3  house-04        2294         2          1
4  house-05        2130         5          2

In [13]:
house_spesification.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49978 entries, 0 to 49977
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   house_id    49978 non-null  object
 1   SquareFeet  49978 non-null  int64
 2   Bedrooms    49978 non-null  int64
 3   Bathrooms   49978 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [14]:
house_spesification.set_index("house_id", inplace=True)
house_spesification.head()

          SquareFeet  Bedrooms  Bathrooms
house_id
house-01        2126         4          1
house-02        2459         3          2
house-03        1860         2          1
house-04        2294         2          1
house-05        2130         5          2

In [15]:
house_pricing.set_index("house_id", inplace=True)
house_pricing.head()

            Neighborhood  YearBuilt          Price
house_id
house-2546         Rural       2011  310456.157638
house-11094        Rural       1976  195310.913642
house-24107        Urban       1976  325239.351743
house-17677        Rural       1952  247969.731066
house-6967        Suburb       1991  300178.479654

In [16]:
house_joined = house_spesification.join(house_pricing,how='inner')
house_joined.head()

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
house_id,,,,,,
house-01,2126,4,1,Rural,1969,215355.283618
house-02,2459,3,2,Rural,1980,195014.221626
house-03,1860,2,1,Suburb,1970,306891.012076
house-04,2294,2,1,Urban,1996,206786.787153
house-05,2130,5,2,Suburb,2001,272436.239065

In [17]:
get_lower_price = house_joined["Price"].min()
print(f"Harga Rumah terendah adalah {get_lower_price}")

Harga Rumah terendah adalah 154.77912007166017

In [18]:
get_higher_price = house_joined["Price"].max()
print(f"Harga Rumah tertinggi adalah {get_higher_price}")

Harga Rumah tertinggi adalah 492195.2599720151

In [19]:
get_mean_price = house_joined["Price"].mean()
print(f"Harga Rata - Rata rumah adalah {get_mean_price}")

Harga Rata - Rata rumah adalah 224931.66795958765

In [20]:
house_joined[house_joined["Price"] == get_lower_price]

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
house_id,,,,,,
house-40145,1006,2,1,Suburb,1973,154.77912

In [21]:
house_joined[house_joined["Price"] == get_higher_price]

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
house_id,,,,,,
house-7431,2758,5,2,Rural,1967,492195.259972

In [22]:
house_joined[house_joined["Price"] <= get_mean_price]

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
house_id,,,,,,
house-01,2126,4,1,Rural,1969,215355.283618
house-02,2459,3,2,Rural,1980,195014.221626
house-04,2294,2,1,Urban,1996,206786.787153
house-06,2095,2,3,Suburb,2020,198208.803907
house-08,2044,4,3,Rural,1957,184992.321268
...,...,...,...,...,...,...
house-49992,1952,5,3,Suburb,1981,200237.485880
house-49993,1818,4,1,Rural,1983,163683.675434
house-49994,1215,2,3,Urban,2017,126052.390562
house-49996,1282,5,3,Rural,1975,100080.865895
house-50000,1572,5,3,Rural,2011,221618.583218

In [23]:
house_joined[house_joined["Price"] >= get_mean_price]

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price
house_id,,,,,,
house-03,1860,2,1,Suburb,1970,306891.012076
house-05,2130,5,2,Suburb,2001,272436.239065
house-07,2724,2,1,Suburb,1993,343429.319110
house-09,2638,4,3,Urban,1959,377998.588152
house-12,2238,3,3,Suburb,1987,253358.645002
...,...,...,...,...,...,...
house-49991,2724,5,2,Suburb,1978,395026.724290
house-49995,2426,5,2,Urban,1950,331497.091307
house-49997,2854,2,2,Suburb,1988,374507.656727
house-49998,2979,5,3,Suburb,1962,384110.555590
house-49999,2596,5,2,Rural,1984,380512.685957

In [24]:
BINNING_SQUARE_FEET = [1000, 1500, 2000, 2500, 3000]

LABEL_BINNING = ["Small Homes","Medium Homes","Midsize Homes","Large Homes"]

house_joined["house_category"] = pd.cut(house_joined["SquareFeet"], bins = BINNING_SQUARE_FEET, labels=LABEL_BINNING)
house_joined

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price,house_category
house_id,,,,,,,
house-01,2126,4,1,Rural,1969,215355.283618,Midsize Homes
house-02,2459,3,2,Rural,1980,195014.221626,Midsize Homes
house-03,1860,2,1,Suburb,1970,306891.012076,Medium Homes
house-04,2294,2,1,Urban,1996,206786.787153,Midsize Homes
house-05,2130,5,2,Suburb,2001,272436.239065,Midsize Homes
...,...,...,...,...,...,...,...
house-49996,1282,5,3,Rural,1975,100080.865895,Small Homes
house-49997,2854,2,2,Suburb,1988,374507.656727,Large Homes
house-49998,2979,5,3,Suburb,1962,384110.555590,Large Homes
house-49999,2596,5,2,Rural,1984,380512.685957,Large Homes
house-50000,1572,5,3,Rural,2011,221618.583218,Medium Homes

In [25]:
house_category = house_joined.groupby(["house_category"]).count()

C:\Users\user\AppData\Local\Temp\ipykernel_2524\758624468.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  house_category = house_joined.groupby(["house_category"]).count()

In [26]:
house_joined[house_joined["house_category"] == "Small Homes"].head()

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price,house_category
house_id,,,,,,,
house-10,1121,5,2,Urban,2004,95961.926014,Small Homes
house-11,1466,5,3,Suburb,1951,191113.768679,Small Homes
house-13,1330,2,2,Suburb,1992,132172.392617,Small Homes
house-15,1087,4,1,Urban,1976,118393.823163,Small Homes
house-20,1130,4,3,Rural,1962,143050.201782,Small Homes

In [27]:
house_joined[house_joined["house_category"] == "Medium Homes"].head()

,SquareFeet,Bedrooms,Bathrooms,Neighborhood,YearBuilt,Price,house_category
house_id,,,,,,,
house-03,1860,2,1,Suburb,1970,306891.012076,Medium Homes
house-18,1871,4,2,Suburb,1977,172989.804901,Medium Homes
house-23,1769,4,1,Suburb,1963,148310.620168,Medium Homes
house-27,1805,5,1,Rural,2002,243985.205472,Medium Homes
house-30,1955,3,1,Rural,2014,240976.551767,Medium Homes

In [28]:
# Menampilkan 5 data tratas pada pada groups "Medium Homes"
house_category.get_group("Medium Homes").head()

AttributeError: 'DataFrame' object has no attribute 'get_group'